---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.UnexpectedFamilyChangeResultsError
source: html/ab868963-fa5f-38a9-beda-f0cadc5543d3.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.UnexpectedFamilyChangeResultsError Property

Changing the family for a MEP fitting might cause unexpected results.

## Syntax (C#)
```csharp
public static FailureDefinitionId UnexpectedFamilyChangeResultsError { get; }
```